In [2]:
#importing liabraries
import pandas as pd
import numpy as np

In [3]:
#loading all datasets
df_sales = pd.read_csv("data/sales_details.csv")
df_prod_info = pd.read_csv('data/prd_info.csv')
df_prod_cat = pd.read_csv('data/PX_CAT_G1V2.csv')
df_cust_info = pd.read_csv('data/cust_info.csv')
df_cust_loc = pd.read_csv('data/LOC_A101.csv')
df_cust_demo = pd.read_csv('data/CUST_AZ12.csv')

## Understanding Data Structure

In [4]:
print("sales detail info")
df_sales.info()
df_sales.head()

sales detail info
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 60398 entries, 0 to 60397
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sls_ord_num   60398 non-null  object
 1   sls_prd_key   60398 non-null  object
 2   sls_cust_id   60398 non-null  int64
 3   sls_order_dt  60398 non-null  int64
 4   sls_ship_dt   60398 non-null  int64
 5   sls_due_dt    60398 non-null  int64
 6   sls_sales     60390 non-null  float64
 7   sls_quantity  60398 non-null  int64
 8   sls_price     60391 non-null  float64
dtypes: float64(2), int64(5), object(2)
memory usage: 4.1+ MB

,sls_ord_num,sls_prd_key,sls_cust_id,sls_order_dt,sls_ship_dt,sls_due_dt,sls_sales,sls_quantity,sls_price
0,SO43697,BK-R93R-62,21768,20101229,20110105,20110110,3578.0,1,3578.0
1,SO43698,BK-M82S-44,28389,20101229,20110105,20110110,3400.0,1,3400.0
2,SO43699,BK-M82S-44,25863,20101229,20110105,20110110,3400.0,1,3400.0
3,SO43700,BK-R50B-62,14501,20101229,20110105,20110110,699.0,1,699.0
4,SO43701,BK-M82S-44,11003,20101229,20110105,20110110,3400.0,1,3400.0

## Sales_info Notes:
Sales Information:
* sales order, ship and due date are in integer type
* sales and price contain null

In [5]:
print("customer detail info")
df_cust_info.info()
df_cust_info.head()

customer detail info
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18494 entries, 0 to 18493
Data columns (total 7 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   cst_id              18490 non-null  float64
 1   cst_key             18494 non-null  object
 2   cst_firstname       18486 non-null  object
 3   cst_lastname        18487 non-null  object
 4   cst_marital_status  18487 non-null  object
 5   cst_gndr            13916 non-null  object
 6   cst_create_date     18490 non-null  object
dtypes: float64(1), object(6)
memory usage: 1011.5+ KB

,cst_id,cst_key,cst_firstname,cst_lastname,cst_marital_status,cst_gndr,cst_create_date
0,11000.0,AW00011000,Jon,Yang,M,M,2025-10-06
1,11001.0,AW00011001,Eugene,Huang,S,M,2025-10-06
2,11002.0,AW00011002,Ruben,Torres,M,M,2025-10-06
3,11003.0,AW00011003,Christy,Zhu,S,F,2025-10-06
4,11004.0,AW00011004,Elizabeth,Johnson,S,F,2025-10-06

### Note:
Customer Information:
* Every column contains null values
* cst_id is not unique
* cst_create_date dtype is object

In [6]:
print("product detail info")
df_prod_info.info()
df_prod_info.head()

product detail info
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 397 entries, 0 to 396
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   prd_id        397 non-null    int64
 1   prd_key       397 non-null    object
 2   prd_nm        397 non-null    object
 3   prd_cost      395 non-null    float64
 4   prd_line      380 non-null    object
 5   prd_start_dt  397 non-null    object
 6   prd_end_dt    200 non-null    object
dtypes: float64(1), int64(1), object(5)
memory usage: 21.8+ KB

,prd_id,prd_key,prd_nm,prd_cost,prd_line,prd_start_dt,prd_end_dt
0,210,CO-RF-FR-R92B-58,HL Road Frame - Black- 58,NaN,R,2003-07-01,NaN
1,211,CO-RF-FR-R92R-58,HL Road Frame - Red- 58,NaN,R,2003-07-01,NaN
2,212,AC-HE-HL-U509-R,Sport-100 Helmet- Red,12.0,S,2011-07-01,2007-12-28
3,213,AC-HE-HL-U509-R,Sport-100 Helmet- Red,14.0,S,2012-07-01,2008-12-27
4,214,AC-HE-HL-U509-R,Sport-100 Helmet- Red,13.0,S,2013-07-01,NaN

In [7]:
print("product category details")
df_prod_cat.info()
df_prod_cat.head()

product category details
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 37 entries, 0 to 36
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   ID           37 non-null     object
 1   CAT          37 non-null     object
 2   SUBCAT       37 non-null     object
 3   MAINTENANCE  37 non-null     object
dtypes: object(4)
memory usage: 1.3+ KB

      ID          CAT             SUBCAT MAINTENANCE
0  AC_BR  Accessories         Bike Racks         Yes
1  AC_BS  Accessories        Bike Stands          No
2  AC_BC  Accessories  Bottles and Cages          No
3  AC_CL  Accessories           Cleaners         Yes
4  AC_FE  Accessories            Fenders          No

In [8]:
print("customer location details")
df_cust_loc.info()
df_cust_loc.head()

customer location details
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18484 entries, 0 to 18483
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   CID     18484 non-null  object
 1   CNTRY   18152 non-null  object
dtypes: object(2)
memory usage: 288.9+ KB

           CID      CNTRY
0  AW-00011000  Australia
1  AW-00011001  Australia
2  AW-00011002  Australia
3  AW-00011003  Australia
4  AW-00011004  Australia

## NOTE:
Customer location information:
* In cntry there is null values

In [9]:
print("customer extra details")
df_cust_demo.info()
df_cust_demo.head()

customer extra details
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18484 entries, 0 to 18483
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   CID     18484 non-null  object
 1   BDATE   18484 non-null  object
 2   GEN     17012 non-null  object
dtypes: object(3)
memory usage: 433.3+ KB

             CID       BDATE     GEN
0  NASAW00011000  1971-10-06    Male
1  NASAW00011001  1976-05-10    Male
2  NASAW00011002  1971-02-09    Male
3  NASAW00011003  1973-08-14  Female
4  NASAW00011004  1979-08-05  Female

## NOTE:
customer extra information:
* customer id start with NAS
* birthdate is object
* gender have null values

## RELATION BETWEWEN TABLE 
* df_sales_info (prd_key) → joins with → df_prod_info (prd_key)
* df_sales_info (cst_id) → joins with → df_cust_info (cst_id)
* df_prod_cat (id) → joins with → df_prod_info (prd_key)
* df_cust_info (cst_key) → joins with → df_cust_loc (cid) and df_cust_demo (cid)

## CLEANING THE CUSTOMER INFORMATION TABLE

In [10]:
df_cust_info.isnull().sum()
df_cust_info.info()
df_cust_info.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18494 entries, 0 to 18493
Data columns (total 7 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   cst_id              18490 non-null  float64
 1   cst_key             18494 non-null  object
 2   cst_firstname       18486 non-null  object
 3   cst_lastname        18487 non-null  object
 4   cst_marital_status  18487 non-null  object
 5   cst_gndr            13916 non-null  object
 6   cst_create_date     18490 non-null  object
dtypes: float64(1), object(6)
memory usage: 1011.5+ KB

,cst_id,cst_key,cst_firstname,cst_lastname,cst_marital_status,cst_gndr,cst_create_date
0,11000.0,AW00011000,Jon,Yang,M,M,2025-10-06
1,11001.0,AW00011001,Eugene,Huang,S,M,2025-10-06
2,11002.0,AW00011002,Ruben,Torres,M,M,2025-10-06
3,11003.0,AW00011003,Christy,Zhu,S,F,2025-10-06
4,11004.0,AW00011004,Elizabeth,Johnson,S,F,2025-10-06

In [11]:
## converting cst_create_date to datetime 

df_cust_info["cst_create_date"] = pd.to_datetime(df_cust_info["cst_create_date"], format = "mixed", errors = "coerce")
df_cust_info["cst_create_date"].info()
df_cust_info["cst_create_date"].head()

<class 'pandas.core.series.Series'>
RangeIndex: 18494 entries, 0 to 18493
Series name: cst_create_date
Non-Null Count  Dtype
--------------  -----
18490 non-null  datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 144.6 KB

0   2025-10-06
1   2025-10-06
2   2025-10-06
3   2025-10-06
4   2025-10-06
Name: cst_create_date, dtype: datetime64[ns]

In [12]:
# droping null in primary key
df_cust_info = df_cust_info.dropna(subset = ["cst_id"])
df_cust_info.isnull().sum()

cst_id                   0
cst_key                  0
cst_firstname            4
cst_lastname             3
cst_marital_status       3
cst_gndr              4574
cst_create_date          0
dtype: int64

In [13]:
# checking repeated values in primary key 
df_cust_info["cst_id"].value_counts()[df_cust_info["cst_id"].value_counts() > 1]

cst_id
29466.0    3
29433.0    2
29449.0    2
29473.0    2
29483.0    2
Name: count, dtype: int64

In [14]:
# keeping one with new date 
df_cust_info = df_cust_info.sort_values(["cst_id","cst_create_date"],ascending = [True,False]).drop_duplicates(subset = "cst_id", keep = "first")

In [15]:
# rechecking the values
df_cust_info["cst_id"].value_counts()[df_cust_info["cst_id"].value_counts() > 1]

Series([], Name: count, dtype: int64)

In [16]:
#changing the type of cst_id to integer
df_cust_info["cst_id"] = df_cust_info["cst_id"].astype(int)

In [17]:
df_cust_info["cst_id"].dtypes

dtype('int64')

In [18]:
# checking extra spaces in firstname 
df_cust_info[df_cust_info["cst_firstname"] != df_cust_info["cst_firstname"].str.strip() ]

,cst_id,cst_key,cst_firstname,cst_lastname,cst_marital_status,cst_gndr,cst_create_date
0,11000,AW00011000,Jon,Yang,M,M,2025-10-06
4,11004,AW00011004,Elizabeth,Johnson,S,F,2025-10-06
12,11012,AW00011012,Lauren,Walker,M,F,2025-10-06
13,11013,AW00011013,Ian,Jenkins,M,M,2025-10-06
15,11015,AW00011015,Chloe,Young,S,F,2025-10-06
21,11021,AW00011021,Destiny,Wilson,S,F,2025-10-07
63,11063,AW00011063,Angela,Murphy,S,F,2025-10-07
65,11065,AW00011065,Jessica,Henderson,M,F,2025-10-07
67,11067,AW00011067,Caleb,Carter,S,M,2025-10-07
70,11070,AW00011070,Willie,Raji,M,M,2025-10-07
109,11109,AW00011109,Ruben,Kapoor,S,M,2025-10-07
140,11140,AW00011140,Javier,Alvarez,S,M,2025-10-07
141,11141,AW00011141,Nicole,Ramirez,M,F,2025-10-07
208,11208,AW00011208,Maria,Reed,M,NaN,2025-10-08
209,11209,AW00011209,Allison,Evans,M,NaN,2025-10-08
229,11229,AW00011229,Adrian,Stewart,S,NaN,2025-10-08
259,11259,AW00011259,Victoria,Stewart,M,NaN,2025-10-08

In [19]:
# removing extra spaces in firstname
df_cust_info.cst_firstname = df_cust_info["cst_firstname"].str.strip()

In [20]:
# rechecking the firstname 
df_cust_info[df_cust_info["cst_firstname"] != df_cust_info["cst_firstname"].str.strip() ]

Empty DataFrame
Columns: [cst_id, cst_key, cst_firstname, cst_lastname, cst_marital_status, cst_gndr, cst_create_date]
Index: []

In [21]:
#checking extra spaces in lastname
df_cust_info[df_cust_info["cst_lastname"] != df_cust_info["cst_lastname"].str.strip() ]

,cst_id,cst_key,cst_firstname,cst_lastname,cst_marital_status,cst_gndr,cst_create_date
0,11000,AW00011000,Jon,Yang,M,M,2025-10-06
1,11001,AW00011001,Eugene,Huang,S,M,2025-10-06
2,11002,AW00011002,Ruben,Torres,M,M,2025-10-06
3,11003,AW00011003,Christy,Zhu,S,F,2025-10-06
12,11012,AW00011012,Lauren,Walker,M,F,2025-10-06
13,11013,AW00011013,Ian,Jenkins,M,M,2025-10-06
21,11021,AW00011021,Destiny,Wilson,S,F,2025-10-07
63,11063,AW00011063,Angela,Murphy,S,F,2025-10-07
64,11064,AW00011064,Chase,Reed,M,M,2025-10-07
65,11065,AW00011065,Jessica,Henderson,M,F,2025-10-07
66,11066,AW00011066,Grace,Butler,M,F,2025-10-07
67,11067,AW00011067,Caleb,Carter,S,M,2025-10-07
70,11070,AW00011070,Willie,Raji,M,M,2025-10-07
71,11071,AW00011071,Linda,Serrano,S,F,2025-10-07
86,11086,AW00011086,Ryan,Brown,M,M,2025-10-07
87,11087,AW00011087,Tamara,Liang,M,F,2025-10-07
109,11109,AW00011109,Ruben,Kapoor,S,M,2025-10-07
167,11167,AW00011167,Jasmine,Barnes,S,NaN,2025-10-07
168,11168,AW00011168,David,Rodriguez,S,NaN,2025-10-07
170,11170,AW00011170,Carol,Howard,M,NaN,2025-10-07
206,11206,AW00011206,Blake,Flores,M,NaN,2025-10-08
208,11208,AW00011208,Maria,Reed,M,NaN,2025-10-08

In [22]:
# Removing the extra spaces 
df_cust_info.cst_lastname = df_cust_info["cst_lastname"].str.strip()

In [23]:
#Rechecking extra spaces in lastname
df_cust_info[df_cust_info["cst_lastname"] != df_cust_info["cst_lastname"].str.strip() ]

Empty DataFrame
Columns: [cst_id, cst_key, cst_firstname, cst_lastname, cst_marital_status, cst_gndr, cst_create_date]
Index: []

In [24]:
# Checking extra spaces in gender
df_cust_info[df_cust_info["cst_gndr"] != df_cust_info["cst_gndr"].str.strip()]

,cst_id,cst_key,cst_firstname,cst_lastname,cst_marital_status,cst_gndr,cst_create_date
160,11160,AW00011160,Maurice,Tang,S,NaN,2025-10-07
161,11161,AW00011161,Emily,Wood,S,NaN,2025-10-07
162,11162,AW00011162,Chase,Cox,S,NaN,2025-10-07
163,11163,AW00011163,Gabriel,Wang,M,NaN,2025-10-07
164,11164,AW00011164,Devin,Brooks,S,NaN,2025-10-07
...,...,...,...,...,...,...,...
18486,29479,AW00029479,Tommy,Tang,M,NaN,2026-01-25
18487,29480,AW00029480,Nina,Raji,S,NaN,2026-01-25
18488,29481,AW00029481,Ivan,Suri,S,NaN,2026-01-25
18489,29482,AW00029482,Clayton,Zhang,M,NaN,2026-01-25
18491,29483,AW00029483,Marc,Navarro,M,NaN,2026-01-27

In [25]:
#checking unique values
df_cust_info["cst_gndr"].unique()

array(['M', 'F', nan], dtype=object)

In [26]:
# how many null in gender
df_cust_info["cst_gndr"].isnull().sum()

np.int64(4569)

In [27]:
df_cust_info["cst_gndr"].value_counts(dropna = False)

cst_gndr
M      7067
F      6848
NaN    4569
Name: count, dtype: int64

In [28]:
# filling the null and writing full form of m and f
df_cust_info.cst_gndr = df_cust_info["cst_gndr"].str.lower()

df_cust_info.cst_gndr = df_cust_info["cst_gndr"].replace({
    "m" : "Male",
    "f" : "Female"
})
df_cust_info.cst_gndr = df_cust_info["cst_gndr"].fillna("n/a")

In [29]:
df_cust_info["cst_gndr"].unique()

array(['Male', 'Female', 'n/a'], dtype=object)

In [30]:
# checking cst_marital_status 

df_cust_info.cst_marital_status.unique()

array(['M', 'S'], dtype=object)

In [31]:
# writing the full name of m and s in marital status
df_cust_info.cst_marital_status = df_cust_info["cst_marital_status"].str.lower()
df_cust_info.cst_marital_status = df_cust_info["cst_marital_status"].replace({
    "m" : "Married",
    "s" : "Single"
})

In [32]:
df_cust_info.cst_marital_status.unique()

array(['Married', 'Single'], dtype=object)

In [33]:
df_cust_info.head()

,cst_id,cst_key,cst_firstname,cst_lastname,cst_marital_status,cst_gndr,cst_create_date
0,11000,AW00011000,Jon,Yang,Married,Male,2025-10-06
1,11001,AW00011001,Eugene,Huang,Single,Male,2025-10-06
2,11002,AW00011002,Ruben,Torres,Married,Male,2025-10-06
3,11003,AW00011003,Christy,Zhu,Single,Female,2025-10-06
4,11004,AW00011004,Elizabeth,Johnson,Single,Female,2025-10-06

## CLEANING THE DF_CUST_LOC TABLE

In [34]:
# understanding the table 

df_cust_loc.info()
df_cust_loc.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18484 entries, 0 to 18483
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   CID     18484 non-null  object
 1   CNTRY   18152 non-null  object
dtypes: object(2)
memory usage: 288.9+ KB

           CID      CNTRY
0  AW-00011000  Australia
1  AW-00011001  Australia
2  AW-00011002  Australia
3  AW-00011003  Australia
4  AW-00011004  Australia

In [35]:
# checking customer id is unique

df_cust_loc["CID"].value_counts()[df_cust_loc["CID"].value_counts() > 1 ]

Series([], Name: count, dtype: int64)

In [36]:
#removing the - in CID 

df_cust_loc['CID'] = df_cust_loc['CID'].str.replace('-', '', regex=False)

In [37]:
# checking nulls in cntry 

df_cust_loc["CNTRY"].isnull().sum()

np.int64(332)

In [38]:
df_cust_loc["CNTRY"].value_counts(dropna = False)

CNTRY
Australia         3591
United States     3391
USA               2591
United Kingdom    1913
France            1810
Canada            1571
US                1500
Germany           1214
DE                 566
NaN                332
                     2
                     2
                     1
Name: count, dtype: int64

In [39]:
# correcting country name and filling the null

df_cust_loc["CNTRY"] = df_cust_loc["CNTRY"].str.lower()

df_cust_loc["CNTRY"] = df_cust_loc["CNTRY"].replace({
    "usa" : "united states",
    "us" : "united states",
    "de" : "germany"
})

df_cust_loc["CNTRY"] = df_cust_loc["CNTRY"].fillna("n/a")

In [40]:
df_cust_loc.CNTRY.value_counts(dropna = False)

CNTRY
united states     7482
australia         3591
united kingdom    1913
france            1810
germany           1780
canada            1571
n/a                332
                     2
                     2
                     1
Name: count, dtype: int64

In [41]:
# converting empty string into nan

df_cust_loc['CNTRY'] = df_cust_loc['CNTRY'].replace(r'^\s*$', np.nan, regex=True)

In [42]:
# filling nan values in country

df_cust_loc["CNTRY"] = df_cust_loc["CNTRY"].fillna("n/a")

In [43]:
df_cust_loc.CNTRY.value_counts(dropna = False)

CNTRY
united states     7482
australia         3591
united kingdom    1913
france            1810
germany           1780
canada            1571
n/a                337
Name: count, dtype: int64

In [44]:
df_cust_loc.CNTRY.unique()

array(['australia', 'united states', 'canada', 'germany',
       'united kingdom', 'france', 'n/a'], dtype=object)

In [45]:
# changing first alphabet capital

df_cust_loc.CNTRY = df_cust_loc["CNTRY"].str.title()

In [46]:
# changing column names 
df_cust_loc.rename(columns = {
    "CID" : "cst_key",
    "CNTRY": "cst_country"
} , inplace = True)

In [47]:
df_cust_loc.head()

      cst_key cst_country
0  AW00011000   Australia
1  AW00011001   Australia
2  AW00011002   Australia
3  AW00011003   Australia
4  AW00011004   Australia

## CLEANING CUSTOMER DEMO TABLE

In [48]:
# understanding the cust_demo table 

df_cust_demo.info()
df_cust_demo.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18484 entries, 0 to 18483
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   CID     18484 non-null  object
 1   BDATE   18484 non-null  object
 2   GEN     17012 non-null  object
dtypes: object(3)
memory usage: 433.3+ KB

             CID       BDATE     GEN
0  NASAW00011000  1971-10-06    Male
1  NASAW00011001  1976-05-10    Male
2  NASAW00011002  1971-02-09    Male
3  NASAW00011003  1973-08-14  Female
4  NASAW00011004  1979-08-05  Female

In [49]:
# first changing the column name 

df_cust_demo.rename( columns = {
    "CID" : "cst_key",
    "BDATE" : "birth_date",
    "GEN" : "cst_gender"
}, inplace = True)

In [50]:
# checking primary key is unique

df_cust_demo["cst_key"].value_counts()[df_cust_demo["cst_key"].value_counts() > 1]

Series([], Name: count, dtype: int64)

In [51]:
# Removing the first 3 letter in cst_id for easy to join 

df_cust_demo.cst_key = df_cust_demo["cst_key"].replace(r"^NAS","",regex = True)

In [52]:
df_cust_demo.cst_key

0        AW00011000
1        AW00011001
2        AW00011002
3        AW00011003
4        AW00011004
            ...
18479    AW00029479
18480    AW00029480
18481    AW00029481
18482    AW00029482
18483    AW00029483
Name: cst_key, Length: 18484, dtype: object

In [53]:
# changing birth-date to datetime 

df_cust_demo.birth_date = pd.to_datetime(df_cust_demo["birth_date"],format = "mixed", errors = "coerce")

In [54]:
df_cust_demo.birth_date.info()

<class 'pandas.core.series.Series'>
RangeIndex: 18484 entries, 0 to 18483
Series name: birth_date
Non-Null Count  Dtype
--------------  -----
18479 non-null  datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 144.5 KB

In [55]:
# checking extra spaces in gender 

df_cust_demo.cst_gender.str.startswith(" ") | df_cust_demo.cst_gender.str.endswith(" ")

0        False
1        False
2        False
3        False
4        False
         ...
18479    False
18480    False
18481    False
18482    False
18483    False
Name: cst_gender, Length: 18484, dtype: bool

In [56]:
df_cust_demo["cst_gender"].unique()

array(['Male', 'Female', '  ', ' ', 'M ', 'F ', 'F', 'M', nan],
      dtype=object)

In [57]:
df_cust_demo["cst_gender"].value_counts(dropna= False)

cst_gender
Male      8608
Female    8391
NaN       1472
F            4
             3
M            3
             1
M            1
F            1
Name: count, dtype: int64

In [58]:
# removing extra spaces and converting into lower
df_cust_demo.cst_gender = df_cust_demo["cst_gender"].str.strip().str.lower()

In [59]:
# removing empty string with n/a 
df_cust_demo["cst_gender"] = df_cust_demo['cst_gender'].replace(r'^\s*$', np.nan, regex=True)

In [60]:
# writing the ful form of m and f
df_cust_demo.cst_gender = df_cust_demo["cst_gender"].replace({
    "m" : "male",
    "f" : "female"
})

In [61]:
# filling the null value with n/a
df_cust_demo["cst_gender"] = df_cust_demo["cst_gender"].fillna("n/a")

In [62]:
# making first lettter capital
df_cust_demo.cst_gender = df_cust_demo["cst_gender"].str.title()

In [63]:
# rechecking
df_cust_demo["cst_gender"].value_counts(dropna= False)

cst_gender
Male      8612
Female    8396
N/A       1476
Name: count, dtype: int64

In [64]:
df_cust_demo.head()

      cst_key birth_date cst_gender
0  AW00011000 1971-10-06       Male
1  AW00011001 1976-05-10       Male
2  AW00011002 1971-02-09       Male
3  AW00011003 1973-08-14     Female
4  AW00011004 1979-08-05     Female

## MERGING THE CUSTOMER TABLES INTO ONE dim_customer

In [65]:
#merging cust_info and cust_loc

df_merge_cust = pd.merge(df_cust_info,df_cust_loc, on = "cst_key",how = "left")

In [66]:
df_merge_cust.head()

,cst_id,cst_key,cst_firstname,cst_lastname,cst_marital_status,cst_gndr,cst_create_date,cst_country
0,11000,AW00011000,Jon,Yang,Married,Male,2025-10-06,Australia
1,11001,AW00011001,Eugene,Huang,Single,Male,2025-10-06,Australia
2,11002,AW00011002,Ruben,Torres,Married,Male,2025-10-06,Australia
3,11003,AW00011003,Christy,Zhu,Single,Female,2025-10-06,Australia
4,11004,AW00011004,Elizabeth,Johnson,Single,Female,2025-10-06,Australia

In [67]:
# final merging with demo table
dim_customer = pd.merge(df_merge_cust, df_cust_demo, on = "cst_key", how = "left")

In [68]:
dim_customer.head()

,cst_id,cst_key,cst_firstname,cst_lastname,cst_marital_status,cst_gndr,cst_create_date,cst_country,birth_date,cst_gender
0,11000,AW00011000,Jon,Yang,Married,Male,2025-10-06,Australia,1971-10-06,Male
1,11001,AW00011001,Eugene,Huang,Single,Male,2025-10-06,Australia,1976-05-10,Male
2,11002,AW00011002,Ruben,Torres,Married,Male,2025-10-06,Australia,1971-02-09,Male
3,11003,AW00011003,Christy,Zhu,Single,Female,2025-10-06,Australia,1973-08-14,Female
4,11004,AW00011004,Elizabeth,Johnson,Single,Female,2025-10-06,Australia,1979-08-05,Female

In [69]:
# selecting better gender column 
dim_customer["cst_gndr"].value_counts()

cst_gndr
Male      7067
Female    6848
n/a       4569
Name: count, dtype: int64

In [70]:
dim_customer["cst_gender"].value_counts()

cst_gender
Male      8612
Female    8396
N/A       1476
Name: count, dtype: int64

## CREATING A NEW COLUMN BY FILLING N/A VALUES IN MAIN TABLE GENDER  USING CRM GENDER COLUMN

In [71]:
# FILLING N/A VALUES WITH ERP customer table 
dim_customer['final_gender'] = dim_customer.apply(
    lambda x: x['cst_gender'] if x['cst_gndr'] == 'n/a' else x['cst_gndr'],
    axis=1
)

In [72]:
dim_customer.head()

,cst_id,cst_key,cst_firstname,cst_lastname,cst_marital_status,cst_gndr,cst_create_date,cst_country,birth_date,cst_gender,final_gender
0,11000,AW00011000,Jon,Yang,Married,Male,2025-10-06,Australia,1971-10-06,Male,Male
1,11001,AW00011001,Eugene,Huang,Single,Male,2025-10-06,Australia,1976-05-10,Male,Male
2,11002,AW00011002,Ruben,Torres,Married,Male,2025-10-06,Australia,1971-02-09,Male,Male
3,11003,AW00011003,Christy,Zhu,Single,Female,2025-10-06,Australia,1973-08-14,Female,Female
4,11004,AW00011004,Elizabeth,Johnson,Single,Female,2025-10-06,Australia,1979-08-05,Female,Female

In [73]:
dim_customer["final_gender"].value_counts()

final_gender
Male      9341
Female    9128
N/A         15
Name: count, dtype: int64

In [74]:
# droping both gender columns 

dim_customer.drop(["cst_gndr","cst_gender"], axis = 1 , inplace = True)

In [169]:
#changing the gender column name 
dim_customer.rename(columns = ({
    "final_gender": "cst_gender",
    "birth_date" : "cst_birthdate" 
    "cst_key" : "cst_number"
}),inplace = True)

In [170]:
dim_customer.head()

,cst_id,cst_number,cst_firstname,cst_lastname,cst_marital_status,cst_create_date,cst_country,cst_birthdate,cst_gender
0,11000,AW00011000,Jon,Yang,Married,2025-10-06,Australia,1971-10-06,Male
1,11001,AW00011001,Eugene,Huang,Single,2025-10-06,Australia,1976-05-10,Male
2,11002,AW00011002,Ruben,Torres,Married,2025-10-06,Australia,1971-02-09,Male
3,11003,AW00011003,Christy,Zhu,Single,2025-10-06,Australia,1973-08-14,Female
4,11004,AW00011004,Elizabeth,Johnson,Single,2025-10-06,Australia,1979-08-05,Female

In [171]:
# adding surrogate key in dim_customer 
dim_customer["cst_key"] = range(1, len(dim_customer) +1)

In [172]:
#checking the surrogate key 
dim_customer.info()
dim_customer.tail()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18484 entries, 0 to 18483
Data columns (total 10 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   cst_id              18484 non-null  int64
 1   cst_number          18484 non-null  object
 2   cst_firstname       18484 non-null  object
 3   cst_lastname        18484 non-null  object
 4   cst_marital_status  18484 non-null  object
 5   cst_create_date     18484 non-null  datetime64[ns]
 6   cst_country         18484 non-null  object
 7   cst_birthdate       18479 non-null  datetime64[ns]
 8   cst_gender          18484 non-null  object
 9   cst_key             18484 non-null  int64
dtypes: datetime64[ns](2), int64(2), object(6)
memory usage: 1.4+ MB

,cst_id,cst_number,cst_firstname,cst_lastname,cst_marital_status,cst_create_date,cst_country,cst_birthdate,cst_gender,cst_key
18479,29479,AW00029479,Tommy,Tang,Married,2026-01-25,France,1969-06-30,N/A,18480
18480,29480,AW00029480,Nina,Raji,Single,2026-01-25,United Kingdom,1977-05-06,N/A,18481
18481,29481,AW00029481,Ivan,Suri,Single,2026-01-25,Germany,1965-07-04,N/A,18482
18482,29482,AW00029482,Clayton,Zhang,Married,2026-01-25,France,1964-09-01,N/A,18483
18483,29483,AW00029483,Marc,Navarro,Married,2026-01-27,France,1965-06-06,N/A,18484

## Saving dim_customer to csv file

In [173]:
dim_customer.to_csv("clean_dim_customer.csv", index= False )

## Cleaning The product columns

In [77]:
# understanding the data
df_prod_info.info()
df_prod_info.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 397 entries, 0 to 396
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   prd_id        397 non-null    int64
 1   prd_key       397 non-null    object
 2   prd_nm        397 non-null    object
 3   prd_cost      395 non-null    float64
 4   prd_line      380 non-null    object
 5   prd_start_dt  397 non-null    object
 6   prd_end_dt    200 non-null    object
dtypes: float64(1), int64(1), object(5)
memory usage: 21.8+ KB

,prd_id,prd_key,prd_nm,prd_cost,prd_line,prd_start_dt,prd_end_dt
0,210,CO-RF-FR-R92B-58,HL Road Frame - Black- 58,NaN,R,2003-07-01,NaN
1,211,CO-RF-FR-R92R-58,HL Road Frame - Red- 58,NaN,R,2003-07-01,NaN
2,212,AC-HE-HL-U509-R,Sport-100 Helmet- Red,12.0,S,2011-07-01,2007-12-28
3,213,AC-HE-HL-U509-R,Sport-100 Helmet- Red,14.0,S,2012-07-01,2008-12-27
4,214,AC-HE-HL-U509-R,Sport-100 Helmet- Red,13.0,S,2013-07-01,NaN

In [78]:
# Checking the primary key is not repeated 
df_prod_info["prd_id"].value_counts()[df_prod_info["prd_id"].value_counts() > 1]

Series([], Name: count, dtype: int64)

In [79]:
#Extracting the cat_id from prd_key 
df_prod_info["cat_id"] = df_prod_info["prd_key"].str.slice(start = 0 , stop = 5 )
df_prod_info["cat_id"] = df_prod_info["cat_id"].str.replace("-","_" ,regex = False)

In [80]:
# checking the cst_id column 
df_prod_info.head()

,prd_id,prd_key,prd_nm,prd_cost,prd_line,prd_start_dt,prd_end_dt,cat_id
0,210,CO-RF-FR-R92B-58,HL Road Frame - Black- 58,NaN,R,2003-07-01,NaN,CO_RF
1,211,CO-RF-FR-R92R-58,HL Road Frame - Red- 58,NaN,R,2003-07-01,NaN,CO_RF
2,212,AC-HE-HL-U509-R,Sport-100 Helmet- Red,12.0,S,2011-07-01,2007-12-28,AC_HE
3,213,AC-HE-HL-U509-R,Sport-100 Helmet- Red,14.0,S,2012-07-01,2008-12-27,AC_HE
4,214,AC-HE-HL-U509-R,Sport-100 Helmet- Red,13.0,S,2013-07-01,NaN,AC_HE

In [81]:
# Correcting the prd_key to join with sls_prd_key
df_prod_info["prd_key"] = df_prod_info["prd_key"].str.slice(start = 6)

In [82]:
df_prod_info.head()

,prd_id,prd_key,prd_nm,prd_cost,prd_line,prd_start_dt,prd_end_dt,cat_id
0,210,FR-R92B-58,HL Road Frame - Black- 58,NaN,R,2003-07-01,NaN,CO_RF
1,211,FR-R92R-58,HL Road Frame - Red- 58,NaN,R,2003-07-01,NaN,CO_RF
2,212,HL-U509-R,Sport-100 Helmet- Red,12.0,S,2011-07-01,2007-12-28,AC_HE
3,213,HL-U509-R,Sport-100 Helmet- Red,14.0,S,2012-07-01,2008-12-27,AC_HE
4,214,HL-U509-R,Sport-100 Helmet- Red,13.0,S,2013-07-01,NaN,AC_HE

In [83]:
# checking unwanted spaces in prd_nm
df_prod_info[df_prod_info["prd_nm"] != df_prod_info["prd_nm"].str.strip()]

Empty DataFrame
Columns: [prd_id, prd_key, prd_nm, prd_cost, prd_line, prd_start_dt, prd_end_dt, cat_id]
Index: []

In [84]:
#Checking if prd_cost contain negative values 
df_prod_info[df_prod_info["prd_cost"] < 0 ]

Empty DataFrame
Columns: [prd_id, prd_key, prd_nm, prd_cost, prd_line, prd_start_dt, prd_end_dt, cat_id]
Index: []

In [85]:
#checking null values in prd_cost
df_prod_info[df_prod_info["prd_cost"].isna()]

,prd_id,prd_key,prd_nm,prd_cost,prd_line,prd_start_dt,prd_end_dt,cat_id
0,210,FR-R92B-58,HL Road Frame - Black- 58,NaN,R,2003-07-01,NaN,CO_RF
1,211,FR-R92R-58,HL Road Frame - Red- 58,NaN,R,2003-07-01,NaN,CO_RF

In [86]:
# filling the null value with median
df_prod_info["prd_cost"].fillna(df_prod_info["prd_cost"].median(), inplace = True)

C:\Users\sharf\AppData\Local\Temp\ipykernel_12272\1618031813.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_prod_info["prd_cost"].fillna(df_prod_info["prd_cost"].median(), inplace = True)

In [87]:
df_prod_info.head()

,prd_id,prd_key,prd_nm,prd_cost,prd_line,prd_start_dt,prd_end_dt,cat_id
0,210,FR-R92B-58,HL Road Frame - Black- 58,205.0,R,2003-07-01,NaN,CO_RF
1,211,FR-R92R-58,HL Road Frame - Red- 58,205.0,R,2003-07-01,NaN,CO_RF
2,212,HL-U509-R,Sport-100 Helmet- Red,12.0,S,2011-07-01,2007-12-28,AC_HE
3,213,HL-U509-R,Sport-100 Helmet- Red,14.0,S,2012-07-01,2008-12-27,AC_HE
4,214,HL-U509-R,Sport-100 Helmet- Red,13.0,S,2013-07-01,NaN,AC_HE

In [88]:
#checking the null values in prd_line 
df_prod_info[df_prod_info["prd_line"].isna()]

,prd_id,prd_key,prd_nm,prd_cost,prd_line,prd_start_dt,prd_end_dt,cat_id
181,391,FK-1639,LL Fork,66.0,NaN,2012-07-01,2008-12-27,CO_FO
182,392,FK-5136,ML Fork,78.0,NaN,2012-07-01,2008-12-27,CO_FO
183,393,FK-9939,HL Fork,102.0,NaN,2012-07-01,2008-12-27,CO_FO
184,394,HS-0296,LL Headset,15.0,NaN,2012-07-01,2008-12-27,CO_HS
185,395,HS-2451,ML Headset,45.0,NaN,2012-07-01,2008-12-27,CO_HS
186,396,HS-3479,HL Headset,55.0,NaN,2012-07-01,2008-12-27,CO_HS
291,501,RD-2308,Rear Derailleur,54.0,NaN,2013-07-01,NaN,CO_DE
304,514,RB-9231,Rear Brakes,47.0,NaN,2013-07-01,NaN,CO_BR
342,552,FD-2342,Front Derailleur,41.0,NaN,2013-07-01,NaN,CO_DE
345,555,FB-9873,Front Brakes,47.0,NaN,2013-07-01,NaN,CO_BR
346,556,CS-4759,LL Crankset,78.0,NaN,2013-07-01,NaN,CO_CS
347,557,CS-6583,ML Crankset,114.0,NaN,2013-07-01,NaN,CO_CS
348,558,CS-9183,HL Crankset,180.0,NaN,2013-07-01,NaN,CO_CS
349,559,CH-0234,Chain,9.0,NaN,2013-07-01,NaN,CO_CH
391,601,BB-7421,LL Bottom Bracket,24.0,NaN,2013-07-01,NaN,CO_BB
392,602,BB-8107,ML Bottom Bracket,45.0,NaN,2013-07-01,NaN,CO_BB
393,603,BB-9108,HL Bottom Bracket,54.0,NaN,2013-07-01,NaN,CO_BB

In [89]:
#checking unique value
df_prod_info["prd_line"].unique()

array(['R ', 'S ', 'M ', nan, 'T '], dtype=object)

In [90]:
#removing spaces
df_prod_info["prd_line"] = df_prod_info["prd_line"].str.strip()

In [91]:
# Writing full form of r s m t 
df_prod_info["prd_line"] = df_prod_info["prd_line"].replace({
    "R" : "Road",
    "S" : "Other Sales",
    "M" : "Mountain",
    "T" : "Touring"
})

In [92]:
#filling null value with n/a 
df_prod_info["prd_line"] = df_prod_info["prd_line"].fillna("n/a")

In [93]:
df_prod_info.prd_line

0             Road
1             Road
2      Other Sales
3      Other Sales
4      Other Sales
          ...
392            n/a
393            n/a
394           Road
395           Road
396           Road
Name: prd_line, Length: 397, dtype: object

In [94]:
#checing unique value in prd_line
df_prod_info["prd_line"].unique()

array(['Road', 'Other Sales', 'Mountain', 'n/a', 'Touring'], dtype=object)

In [95]:
#checking the data type prd_start_dt
df_prod_info["prd_start_dt"].dtype

dtype('O')

In [96]:
#checking the data type prd_end_dt
df_prod_info["prd_end_dt"].dtype

dtype('O')

In [97]:
#changing the type of prd_start_dt and end_dt
df_prod_info["prd_start_dt"] = pd.to_datetime(df_prod_info["prd_start_dt"], format = "mixed", errors = "coerce")
df_prod_info["prd_end_dt"] = pd.to_datetime(df_prod_info["prd_end_dt"], format = "mixed", errors = "coerce")

In [98]:
df_prod_info[['prd_start_dt',"prd_end_dt"]]

    prd_start_dt prd_end_dt
0     2003-07-01        NaT
1     2003-07-01        NaT
2     2011-07-01 2007-12-28
3     2012-07-01 2008-12-27
4     2013-07-01        NaT
..           ...        ...
392   2013-07-01        NaT
393   2013-07-01        NaT
394   2013-07-01        NaT
395   2013-07-01        NaT
396   2013-07-01        NaT

[397 rows x 2 columns]

In [99]:
#checking start and end date are correct 
df_prod_info[df_prod_info["prd_end_dt"] < df_prod_info["prd_start_dt"]]

,prd_id,prd_key,prd_nm,prd_cost,prd_line,prd_start_dt,prd_end_dt,cat_id
2,212,HL-U509-R,Sport-100 Helmet- Red,12.0,Other Sales,2011-07-01,2007-12-28,AC_HE
3,213,HL-U509-R,Sport-100 Helmet- Red,14.0,Other Sales,2012-07-01,2008-12-27,AC_HE
5,215,HL-U509,Sport-100 Helmet- Black,12.0,Other Sales,2011-07-01,2007-12-28,AC_HE
6,216,HL-U509,Sport-100 Helmet- Black,14.0,Other Sales,2012-07-01,2008-12-27,AC_HE
8,218,SO-B909-M,Mountain Bike Socks- M,3.0,Mountain,2011-07-01,2007-12-28,CL_SO
...,...,...,...,...,...,...,...,...
254,464,GL-H102-M,Half-Finger Gloves- M,10.0,Other Sales,2012-07-01,2008-12-27,CL_GL
256,466,GL-H102-L,Half-Finger Gloves- L,10.0,Other Sales,2012-07-01,2008-12-27,CL_GL
258,468,GL-F110-S,Full-Finger Gloves- S,16.0,Mountain,2012-07-01,2008-12-27,CL_GL
259,469,GL-F110-M,Full-Finger Gloves- M,16.0,Mountain,2012-07-01,2008-12-27,CL_GL
260,470,GL-F110-L,Full-Finger Gloves- L,16.0,Mountain,2012-07-01,2008-12-27,CL_GL

* End date is earlier then the start date

In [100]:
 # Sort by key and start date to maintain order
df_prod_info = df_prod_info.sort_values(["prd_key", "prd_start_dt"])

# Creating the next start date (LEAD equivalent)
df_prod_info["next_start_dt"] = df_prod_info.groupby("prd_key")["prd_start_dt"].shift(-1)

# Subtract 1 day to get end date
df_prod_info["prd_end_dt"] = df_prod_info["next_start_dt"] - pd.Timedelta(days=1)

#  Drop helper column
df_prod_info.drop(columns="next_start_dt", inplace=True)

In [101]:
# rechecking the end date 
df_prod_info[df_prod_info["prd_end_dt"] < df_prod_info["prd_start_dt"]]

Empty DataFrame
Columns: [prd_id, prd_key, prd_nm, prd_cost, prd_line, prd_start_dt, prd_end_dt, cat_id]
Index: []

In [102]:
df_prod_info

,prd_id,prd_key,prd_nm,prd_cost,prd_line,prd_start_dt,prd_end_dt,cat_id
391,601,BB-7421,LL Bottom Bracket,24.0,n/a,2013-07-01,NaT,CO_BB
392,602,BB-8107,ML Bottom Bracket,45.0,n/a,2013-07-01,NaT,CO_BB
393,603,BB-9108,HL Bottom Bracket,54.0,n/a,2013-07-01,NaT,CO_BB
268,478,BC-M005,Mountain Bottle Cage,4.0,Mountain,2013-07-01,NaT,AC_BC
269,479,BC-R205,Road Bottle Cage,3.0,Road,2013-07-01,NaT,AC_BC
...,...,...,...,...,...,...,...,...
320,530,TT-T092,Touring Tire Tube,2.0,Touring,2013-07-01,NaT,AC_TT
263,473,VE-C304-L,Classic Vest- L,24.0,Other Sales,2013-07-01,NaT,CL_VE
262,472,VE-C304-M,Classic Vest- M,24.0,Other Sales,2013-07-01,NaT,CL_VE
261,471,VE-C304-S,Classic Vest- S,24.0,Other Sales,2013-07-01,NaT,CL_VE
267,477,WB-H098,Water Bottle - 30 oz.,2.0,Other Sales,2013-07-01,NaT,AC_BC

## Cleaning Product catagory

In [103]:
df_prod_cat.info()
df_prod_cat.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 37 entries, 0 to 36
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   ID           37 non-null     object
 1   CAT          37 non-null     object
 2   SUBCAT       37 non-null     object
 3   MAINTENANCE  37 non-null     object
dtypes: object(4)
memory usage: 1.3+ KB

      ID          CAT             SUBCAT MAINTENANCE
0  AC_BR  Accessories         Bike Racks         Yes
1  AC_BS  Accessories        Bike Stands          No
2  AC_BC  Accessories  Bottles and Cages          No
3  AC_CL  Accessories           Cleaners         Yes
4  AC_FE  Accessories            Fenders          No

In [104]:
# renaming the columns 
df_prod_cat.rename(columns = {
    "ID" : "cat_id",
    "CAT" : "category",
    "SUBCAT" : "sub_category",
    "MAINTENANCE" : "maintenance"
},inplace = True)

In [105]:
df_prod_cat.columns

Index(['cat_id', 'category', 'sub_category', 'maintenance'], dtype='object')

In [106]:
#checking extra spaces in cst_id 
df_prod_cat[df_prod_cat["cat_id"] != df_prod_cat["cat_id"].str.strip()]

Empty DataFrame
Columns: [cat_id, category, sub_category, maintenance]
Index: []

In [107]:
#checing the extra spaces in category
df_prod_cat[df_prod_cat["category"] != df_prod_cat["category"].str.strip()]

Empty DataFrame
Columns: [cat_id, category, sub_category, maintenance]
Index: []

In [108]:
#checking nulls in category 
df_prod_cat["category"].isna().sum()

np.int64(0)

In [109]:
#checking the extra spaces in sub category 
df_prod_cat[df_prod_cat["sub_category"] != df_prod_cat["sub_category"].str.strip()]

Empty DataFrame
Columns: [cat_id, category, sub_category, maintenance]
Index: []

In [110]:
#checking nulls in category 
df_prod_cat["sub_category"].isna().sum()

np.int64(0)

In [111]:
#checking the extra spaces in sub category 
df_prod_cat[df_prod_cat["maintenance"] != df_prod_cat["maintenance"].str.strip()]

Empty DataFrame
Columns: [cat_id, category, sub_category, maintenance]
Index: []

In [112]:
#checking nulls in category 
df_prod_cat["maintenance"].isna().sum()

np.int64(0)

# Merging the product information table with product category and creating dim_products

In [113]:
dim_product = pd.merge(df_prod_info, df_prod_cat, on = "cat_id", how = "left")

In [114]:
dim_product.head()

,prd_id,prd_key,prd_nm,prd_cost,prd_line,prd_start_dt,prd_end_dt,cat_id,category,sub_category,maintenance
0,601,BB-7421,LL Bottom Bracket,24.0,n/a,2013-07-01,NaT,CO_BB,Components,Bottom Brackets,Yes
1,602,BB-8107,ML Bottom Bracket,45.0,n/a,2013-07-01,NaT,CO_BB,Components,Bottom Brackets,Yes
2,603,BB-9108,HL Bottom Bracket,54.0,n/a,2013-07-01,NaT,CO_BB,Components,Bottom Brackets,Yes
3,478,BC-M005,Mountain Bottle Cage,4.0,Mountain,2013-07-01,NaT,AC_BC,Accessories,Bottles and Cages,No
4,479,BC-R205,Road Bottle Cage,3.0,Road,2013-07-01,NaT,AC_BC,Accessories,Bottles and Cages,No

In [115]:
# Filter for nulls and droping the end date column
dim_product = dim_product[dim_product['prd_end_dt'].isnull()].drop(columns=['prd_end_dt'])

In [160]:
#changing the dim product column name 
dim_product = dim_product.rename(columns = {
    "prd_key" : "prd_number",
    "prd_nm" : "prd_name"
})

In [161]:
dim_product.tail()

,prd_id,prd_number,prd_name,prd_cost,prd_line,prd_start_dt,cat_id,category,sub_category,maintenance
392,530,TT-T092,Touring Tire Tube,2.0,Touring,2013-07-01,AC_TT,Accessories,Tires and Tubes,Yes
393,473,VE-C304-L,Classic Vest- L,24.0,Other Sales,2013-07-01,CL_VE,Clothing,Vests,No
394,472,VE-C304-M,Classic Vest- M,24.0,Other Sales,2013-07-01,CL_VE,Clothing,Vests,No
395,471,VE-C304-S,Classic Vest- S,24.0,Other Sales,2013-07-01,CL_VE,Clothing,Vests,No
396,477,WB-H098,Water Bottle - 30 oz.,2.0,Other Sales,2013-07-01,AC_BC,Accessories,Bottles and Cages,No

In [162]:
# add surrogate key in dim_product 
dim_product["prd_key"] = range(1, len(dim_product) + 1)

In [167]:
# checking the surrogate key 
dim_product.info()
dim_product.tail()

<class 'pandas.core.frame.DataFrame'>
Index: 295 entries, 0 to 396
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   prd_id        295 non-null    int64
 1   prd_number    295 non-null    object
 2   prd_name      295 non-null    object
 3   prd_cost      295 non-null    float64
 4   prd_line      295 non-null    object
 5   prd_start_dt  295 non-null    datetime64[ns]
 6   cat_id        295 non-null    object
 7   category      288 non-null    object
 8   sub_category  288 non-null    object
 9   maintenance   288 non-null    object
 10  prd_key       295 non-null    int64
dtypes: datetime64[ns](1), float64(1), int64(2), object(7)
memory usage: 27.7+ KB

,prd_id,prd_number,prd_name,prd_cost,prd_line,prd_start_dt,cat_id,category,sub_category,maintenance,prd_key
392,530,TT-T092,Touring Tire Tube,2.0,Touring,2013-07-01,AC_TT,Accessories,Tires and Tubes,Yes,291
393,473,VE-C304-L,Classic Vest- L,24.0,Other Sales,2013-07-01,CL_VE,Clothing,Vests,No,292
394,472,VE-C304-M,Classic Vest- M,24.0,Other Sales,2013-07-01,CL_VE,Clothing,Vests,No,293
395,471,VE-C304-S,Classic Vest- S,24.0,Other Sales,2013-07-01,CL_VE,Clothing,Vests,No,294
396,477,WB-H098,Water Bottle - 30 oz.,2.0,Other Sales,2013-07-01,AC_BC,Accessories,Bottles and Cages,No,295

* creating csv file of dim_product

In [168]:
dim_product.to_csv("clean_dim_product.csv", index = False)

# Cleaning the sales table

In [118]:
#understanding the table
df_sales.info()
df_sales.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 60398 entries, 0 to 60397
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sls_ord_num   60398 non-null  object
 1   sls_prd_key   60398 non-null  object
 2   sls_cust_id   60398 non-null  int64
 3   sls_order_dt  60398 non-null  int64
 4   sls_ship_dt   60398 non-null  int64
 5   sls_due_dt    60398 non-null  int64
 6   sls_sales     60390 non-null  float64
 7   sls_quantity  60398 non-null  int64
 8   sls_price     60391 non-null  float64
dtypes: float64(2), int64(5), object(2)
memory usage: 4.1+ MB

,sls_ord_num,sls_prd_key,sls_cust_id,sls_order_dt,sls_ship_dt,sls_due_dt,sls_sales,sls_quantity,sls_price
0,SO43697,BK-R93R-62,21768,20101229,20110105,20110110,3578.0,1,3578.0
1,SO43698,BK-M82S-44,28389,20101229,20110105,20110110,3400.0,1,3400.0
2,SO43699,BK-M82S-44,25863,20101229,20110105,20110110,3400.0,1,3400.0
3,SO43700,BK-R50B-62,14501,20101229,20110105,20110110,699.0,1,699.0
4,SO43701,BK-M82S-44,11003,20101229,20110105,20110110,3400.0,1,3400.0

In [119]:
#changing type of order, ship, due date
df_sales["sls_order_dt"] = pd.to_datetime(df_sales["sls_order_dt"].astype(str), format = "%Y%m%d", errors = "coerce")
df_sales["sls_ship_dt"] = pd.to_datetime(df_sales["sls_ship_dt"].astype(str), format= "%Y%m%d", errors = "coerce")
df_sales["sls_due_dt"] = pd.to_datetime(df_sales["sls_due_dt"].astype(str), format= "%Y%m%d", errors = "coerce")

In [120]:
df_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 60398 entries, 0 to 60397
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sls_ord_num   60398 non-null  object
 1   sls_prd_key   60398 non-null  object
 2   sls_cust_id   60398 non-null  int64
 3   sls_order_dt  60379 non-null  datetime64[ns]
 4   sls_ship_dt   60398 non-null  datetime64[ns]
 5   sls_due_dt    60398 non-null  datetime64[ns]
 6   sls_sales     60390 non-null  float64
 7   sls_quantity  60398 non-null  int64
 8   sls_price     60391 non-null  float64
dtypes: datetime64[ns](3), float64(2), int64(2), object(2)
memory usage: 4.1+ MB

In [121]:
#checking the order date is smaller than the ship date
df_sales[df_sales["sls_order_dt"] > df_sales["sls_ship_dt"]]

Empty DataFrame
Columns: [sls_ord_num, sls_prd_key, sls_cust_id, sls_order_dt, sls_ship_dt, sls_due_dt, sls_sales, sls_quantity, sls_price]
Index: []

In [122]:
#checking the order date is smaller than the due date
df_sales[df_sales["sls_order_dt"] > df_sales["sls_due_dt"]]

Empty DataFrame
Columns: [sls_ord_num, sls_prd_key, sls_cust_id, sls_order_dt, sls_ship_dt, sls_due_dt, sls_sales, sls_quantity, sls_price]
Index: []

In [123]:
df_sales.head()

,sls_ord_num,sls_prd_key,sls_cust_id,sls_order_dt,sls_ship_dt,sls_due_dt,sls_sales,sls_quantity,sls_price
0,SO43697,BK-R93R-62,21768,2010-12-29,2011-01-05,2011-01-10,3578.0,1,3578.0
1,SO43698,BK-M82S-44,28389,2010-12-29,2011-01-05,2011-01-10,3400.0,1,3400.0
2,SO43699,BK-M82S-44,25863,2010-12-29,2011-01-05,2011-01-10,3400.0,1,3400.0
3,SO43700,BK-R50B-62,14501,2010-12-29,2011-01-05,2011-01-10,699.0,1,699.0
4,SO43701,BK-M82S-44,11003,2010-12-29,2011-01-05,2011-01-10,3400.0,1,3400.0

In [124]:
#checking sales is equal to quantity * price
df_sales[df_sales["sls_sales"] != df_sales["sls_quantity"] * df_sales["sls_price"]]

,sls_ord_num,sls_prd_key,sls_cust_id,sls_order_dt,sls_ship_dt,sls_due_dt,sls_sales,sls_quantity,sls_price
5658,SO51259,WB-H098,11433,2013-01-01,2013-01-08,2013-01-13,10.0,2,NaN
5770,SO51298,WB-H098,27949,2013-01-04,2013-01-11,2013-01-16,25.0,5,NaN
6018,SO51387,HL-U509-B,11942,2013-01-09,2013-01-16,2013-01-21,70.0,2,NaN
6271,SO51479,BC-R205,16687,2013-01-16,2013-01-23,2013-01-28,9.0,1,NaN
6273,SO51479,HL-U509,16687,2013-01-16,2013-01-23,2013-01-28,35.0,1,NaN
6997,SO51942,BC-M005,11223,2013-01-29,2013-02-05,2013-02-10,100.0,10,NaN
7567,SO52187,CL-9009,18110,2013-02-03,2013-02-10,2013-02-15,16.0,2,NaN
20142,SO57804,BK-M38S-40,16470,2013-05-11,2013-05-18,2013-05-23,769.0,1,-769.0
20423,SO57916,TI-M602,23024,2013-05-13,2013-05-20,2013-05-25,30.0,1,-30.0
21447,SO58326,FE-6654,12045,2013-05-20,2013-05-27,2013-06-01,22.0,1,-22.0
21467,SO58335,TI-M823,13326,2013-05-20,2013-05-27,2013-06-01,35.0,2,35.0
22189,SO58623,BK-R79Y-44,17012,2013-05-25,2013-06-01,2013-06-06,1701.0,1,-1701.0
22655,SO58818,TI-R092,21387,2013-05-28,2013-06-04,2013-06-09,21.0,1,-21.0
28826,SO61548,LJ-0192-L,12386,2013-07-05,2013-07-12,2013-07-17,50.0,2,50.0
28827,SO61548,CA-1098,12386,2013-07-05,2013-07-12,2013-07-17,NaN,1,9.0
28858,SO61560,HL-U509,16213,2013-07-05,2013-07-12,2013-07-17,NaN,1,35.0
28860,SO61561,CL-9009,18380,2013-07-05,2013-07-12,2013-07-17,NaN,1,8.0
28861,SO61562,FE-6654,18944,2013-07-05,2013-07-12,2013-07-17,NaN,1,22.0
28884,SO61570,CA-1098,17809,2013-07-05,2013-07-12,2013-07-17,-18.0,1,9.0
29058,SO61636,BC-M005,12914,2013-07-06,2013-07-13,2013-07-18,0.0,1,10.0
29659,SO61879,LJ-0192-X,14455,2013-07-10,2013-07-17,2013-07-22,50.0,2,50.0
42557,SO67551,BC-M005,15150,2013-10-01,2013-10-08,2013-10-13,NaN,1,10.0
42941,SO67707,TT-M928,26046,2013-10-04,2013-10-11,2013-10-16,5.0,2,5.0
42942,SO67707,VE-C304-S,26046,2013-10-04,2013-10-11,2013-10-16,64.0,4,64.0
42943,SO67708,TI-M267,26501,2013-10-04,2013-10-11,2013-10-16,25.0,3,25.0
43644,SO67993,PK-7098,17084,2013-10-08,2013-10-15,2013-10-20,40.0,1,2.0
43964,SO68126,LJ-0192-M,13604,2013-10-10,2013-10-17,2013-10-22,2.0,1,50.0
44690,SO68418,GL-H102-M,25277,2013-10-15,2013-10-22,2013-10-27,33.0,1,24.0
45033,SO68551,BC-R205,22691,2013-10-17,2013-10-24,2013-10-29,8.0,1,9.0
45127,SO68588,PK-7098,11318,2013-10-17,2013-10-24,2013-10-29,NaN,1,2.0
45547,SO68745,HL-U509,18262,2013-10-20,2013-10-27,2013-11-01,NaN,1,35.0
45548,SO68745,GL-H102-L,18262,2013-10-20,2013-10-27,2013-11-01,NaN,1,24.0
45882,SO68889,TT-R982,14086,2013-10-22,2013-10-29,2013-11-03,0.0,1,4.0
46329,SO69066,SJ-0194-L,17923,2013-10-24,2013-10-31,2013-11-05,-54.0,1,54.0
46697,SO69215,TI-M823,16864,NaT,2013-11-02,2013-11-07,-35.0,1,35.0

In [125]:
# Calculateing the Expected Sales Value (Quantity * Absolute Price)
expected_sales = df_sales["sls_quantity"] * df_sales["sls_price"].abs()


#using 0.01 for value greater than 0 
tolerance = 0.01
cond = (
    df_sales["sls_sales"].isna() | 
    (df_sales["sls_sales"] <= 0) | 
    (abs(df_sales["sls_sales"] - expected_sales) > tolerance)
)

# appling the condition
df_sales.loc[cond, "sls_sales"] = expected_sales

In [126]:
#checking sales is equal to quantity * price
df_sales[df_sales["sls_sales"] != df_sales["sls_quantity"] * df_sales["sls_price"]]

,sls_ord_num,sls_prd_key,sls_cust_id,sls_order_dt,sls_ship_dt,sls_due_dt,sls_sales,sls_quantity,sls_price
5658,SO51259,WB-H098,11433,2013-01-01,2013-01-08,2013-01-13,10.0,2,NaN
5770,SO51298,WB-H098,27949,2013-01-04,2013-01-11,2013-01-16,25.0,5,NaN
6018,SO51387,HL-U509-B,11942,2013-01-09,2013-01-16,2013-01-21,70.0,2,NaN
6271,SO51479,BC-R205,16687,2013-01-16,2013-01-23,2013-01-28,9.0,1,NaN
6273,SO51479,HL-U509,16687,2013-01-16,2013-01-23,2013-01-28,35.0,1,NaN
6997,SO51942,BC-M005,11223,2013-01-29,2013-02-05,2013-02-10,100.0,10,NaN
7567,SO52187,CL-9009,18110,2013-02-03,2013-02-10,2013-02-15,16.0,2,NaN
20142,SO57804,BK-M38S-40,16470,2013-05-11,2013-05-18,2013-05-23,769.0,1,-769.0
20423,SO57916,TI-M602,23024,2013-05-13,2013-05-20,2013-05-25,30.0,1,-30.0
21447,SO58326,FE-6654,12045,2013-05-20,2013-05-27,2013-06-01,22.0,1,-22.0
22189,SO58623,BK-R79Y-44,17012,2013-05-25,2013-06-01,2013-06-06,1701.0,1,-1701.0
22655,SO58818,TI-R092,21387,2013-05-28,2013-06-04,2013-06-09,21.0,1,-21.0

In [127]:
#correcting the sales price column 
df_sales["sls_price"] = df_sales["sls_sales"] / df_sales["sls_quantity"]

In [128]:
#checking the sales price coloumn
df_sales[df_sales["sls_price"] != df_sales["sls_sales"] / df_sales["sls_quantity"]]

Empty DataFrame
Columns: [sls_ord_num, sls_prd_key, sls_cust_id, sls_order_dt, sls_ship_dt, sls_due_dt, sls_sales, sls_quantity, sls_price]
Index: []

In [129]:
#Rechecking sales is equal to quantity * price
df_sales[df_sales["sls_sales"] != df_sales["sls_quantity"] * df_sales["sls_price"]]

Empty DataFrame
Columns: [sls_ord_num, sls_prd_key, sls_cust_id, sls_order_dt, sls_ship_dt, sls_due_dt, sls_sales, sls_quantity, sls_price]
Index: []

In [147]:
df_sales.info()
df_sales.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 60398 entries, 0 to 60397
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sls_ord_num   60398 non-null  object
 1   sls_prd_key   60398 non-null  object
 2   sls_cust_id   60398 non-null  int64
 3   sls_order_dt  60379 non-null  datetime64[ns]
 4   sls_ship_dt   60398 non-null  datetime64[ns]
 5   sls_due_dt    60398 non-null  datetime64[ns]
 6   sls_sales     60398 non-null  float64
 7   sls_quantity  60398 non-null  int64
 8   sls_price     60398 non-null  float64
dtypes: datetime64[ns](3), float64(2), int64(2), object(2)
memory usage: 4.1+ MB

,sls_ord_num,sls_prd_key,sls_cust_id,sls_order_dt,sls_ship_dt,sls_due_dt,sls_sales,sls_quantity,sls_price
0,SO43697,BK-R93R-62,21768,2010-12-29,2011-01-05,2011-01-10,3578.0,1,3578.0
1,SO43698,BK-M82S-44,28389,2010-12-29,2011-01-05,2011-01-10,3400.0,1,3400.0
2,SO43699,BK-M82S-44,25863,2010-12-29,2011-01-05,2011-01-10,3400.0,1,3400.0
3,SO43700,BK-R50B-62,14501,2010-12-29,2011-01-05,2011-01-10,699.0,1,699.0
4,SO43701,BK-M82S-44,11003,2010-12-29,2011-01-05,2011-01-10,3400.0,1,3400.0

In [174]:
dim_customer.head()

,cst_id,cst_number,cst_firstname,cst_lastname,cst_marital_status,cst_create_date,cst_country,cst_birthdate,cst_gender,cst_key
0,11000,AW00011000,Jon,Yang,Married,2025-10-06,Australia,1971-10-06,Male,1
1,11001,AW00011001,Eugene,Huang,Single,2025-10-06,Australia,1976-05-10,Male,2
2,11002,AW00011002,Ruben,Torres,Married,2025-10-06,Australia,1971-02-09,Male,3
3,11003,AW00011003,Christy,Zhu,Single,2025-10-06,Australia,1973-08-14,Female,4
4,11004,AW00011004,Elizabeth,Johnson,Single,2025-10-06,Australia,1979-08-05,Female,5

In [175]:
dim_product.head()

,prd_id,prd_number,prd_name,prd_cost,prd_line,prd_start_dt,cat_id,category,sub_category,maintenance,prd_key
0,601,BB-7421,LL Bottom Bracket,24.0,n/a,2013-07-01,CO_BB,Components,Bottom Brackets,Yes,1
1,602,BB-8107,ML Bottom Bracket,45.0,n/a,2013-07-01,CO_BB,Components,Bottom Brackets,Yes,2
2,603,BB-9108,HL Bottom Bracket,54.0,n/a,2013-07-01,CO_BB,Components,Bottom Brackets,Yes,3
3,478,BC-M005,Mountain Bottle Cage,4.0,Mountain,2013-07-01,AC_BC,Accessories,Bottles and Cages,No,4
4,479,BC-R205,Road Bottle Cage,3.0,Road,2013-07-01,AC_BC,Accessories,Bottles and Cages,No,5

# Creating fact sale table

In [182]:
# replacing the column sls_prd_key and sls_cust_id with dimension customer key(surrogate key) and dimension product key (surrogate key)for better joining 
fact_sales = pd.merge(df_sales, dim_product[["prd_key","prd_number"]] , left_on = "sls_prd_key", right_on = "prd_number", how = "left")

In [178]:
fact_sales.head()

,sls_ord_num,sls_prd_key,sls_cust_id,sls_order_dt,sls_ship_dt,sls_due_dt,sls_sales,sls_quantity,sls_price,prd_key,prd_number
0,SO43697,BK-R93R-62,21768,2010-12-29,2011-01-05,2011-01-10,3578.0,1,3578.0,80,BK-R93R-62
1,SO43698,BK-M82S-44,28389,2010-12-29,2011-01-05,2011-01-10,3400.0,1,3400.0,36,BK-M82S-44
2,SO43699,BK-M82S-44,25863,2010-12-29,2011-01-05,2011-01-10,3400.0,1,3400.0,36,BK-M82S-44
3,SO43700,BK-R50B-62,14501,2010-12-29,2011-01-05,2011-01-10,699.0,1,699.0,47,BK-R50B-62
4,SO43701,BK-M82S-44,11003,2010-12-29,2011-01-05,2011-01-10,3400.0,1,3400.0,36,BK-M82S-44

In [183]:
# deleting the sls_prd_key and prd_key 
fact_sales.drop(columns = {
    "prd_number",
    "sls_prd_key"
}, inplace= True)

In [184]:
fact_sales.head()

,sls_ord_num,sls_cust_id,sls_order_dt,sls_ship_dt,sls_due_dt,sls_sales,sls_quantity,sls_price,prd_key
0,SO43697,21768,2010-12-29,2011-01-05,2011-01-10,3578.0,1,3578.0,80
1,SO43698,28389,2010-12-29,2011-01-05,2011-01-10,3400.0,1,3400.0,36
2,SO43699,25863,2010-12-29,2011-01-05,2011-01-10,3400.0,1,3400.0,36
3,SO43700,14501,2010-12-29,2011-01-05,2011-01-10,699.0,1,699.0,47
4,SO43701,11003,2010-12-29,2011-01-05,2011-01-10,3400.0,1,3400.0,36

In [187]:
# adding the cst_key column in fact_sles
fact_sales = pd.merge(fact_sales, dim_customer[["cst_key", "cst_id"]], left_on = "sls_cust_id", right_on = "cst_id", how = "left")

In [188]:
fact_sales.head()

,sls_ord_num,sls_cust_id,sls_order_dt,sls_ship_dt,sls_due_dt,sls_sales,sls_quantity,sls_price,prd_key,cst_key,cst_id
0,SO43697,21768,2010-12-29,2011-01-05,2011-01-10,3578.0,1,3578.0,80,10769,21768
1,SO43698,28389,2010-12-29,2011-01-05,2011-01-10,3400.0,1,3400.0,36,17390,28389
2,SO43699,25863,2010-12-29,2011-01-05,2011-01-10,3400.0,1,3400.0,36,14864,25863
3,SO43700,14501,2010-12-29,2011-01-05,2011-01-10,699.0,1,699.0,47,3502,14501
4,SO43701,11003,2010-12-29,2011-01-05,2011-01-10,3400.0,1,3400.0,36,4,11003

In [189]:
# dropning the cst_id and sls_cust_id column 
fact_sales.drop(columns = {
    "sls_cust_id",
    "cst_id"
},inplace = True)

In [190]:
fact_sales.head()

,sls_ord_num,sls_order_dt,sls_ship_dt,sls_due_dt,sls_sales,sls_quantity,sls_price,prd_key,cst_key
0,SO43697,2010-12-29,2011-01-05,2011-01-10,3578.0,1,3578.0,80,10769
1,SO43698,2010-12-29,2011-01-05,2011-01-10,3400.0,1,3400.0,36,17390
2,SO43699,2010-12-29,2011-01-05,2011-01-10,3400.0,1,3400.0,36,14864
3,SO43700,2010-12-29,2011-01-05,2011-01-10,699.0,1,699.0,47,3502
4,SO43701,2010-12-29,2011-01-05,2011-01-10,3400.0,1,3400.0,36,4

# saving fact sales in csv form

In [191]:
fact_sales.to_csv("clean_fact_sales.csv", index = False)